arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
<?xml version="1.0" encoding="utf-8"?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" schemaVersion="1.3">
  <vendor>Renesas</vendor>
  <vendorID>Renesas</vendorID>
  <name>RA</name>
  <series>All Chips</series>
  <version>x.xx</version>
  <description>Renesas RA All MCU</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
  <peripheral>
      <name>OSM</name>
      <description>Option Setting Memory</description>
      <baseAddress>0x00000400</baseAddress>
      <registers>
        <register>
          <name>OFS0</name>
          <description>Option Function Select Register 0</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read</access>
          <fields>
          </fields>
        </register>
        <register>
          <name>OFS1</name>
          <description>Option Function Select Register 1</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read</access>
          <fields>
            <field>
              <name>HOCOFRQ1</name>
              <description>HOCO Frequency Setting 1</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24 MHz</name>
                  <description></description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32 MHz</name>
                  <description></description>
                  <value>#2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48 MHz</name>
                  <description></description>
                  <value>#4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64 MHz</name>
                  <description></description>
                  <value>#5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOCOEN</name>
              <description>HOCO Oscillation Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description></description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description></description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>R_ACMPHS0</name>
      <description>High-Speed Analog Comparator</description>
      <baseAddress>0x40085000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000000C</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMPCTL</name>
          <description>Comparator Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>HCMPON</name>
              <description>Comparator operation control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Operation stopped (the comparator outputs a low-level signal)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Operation enabled (input to the comparator pins is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDFS</name>
              <description>Noise filter selection</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Noise filter not used.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Noise filter sampling frequency is 2^3/PCLKB.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Noise filter sampling frequency is 2^4/PCLKB. </description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Noise filter sampling frequency is 2^5/PCLKB.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEG</name>
              <description>Selection of valid edge (Edge selector) </description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>No edge selection.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Rising edge selection.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Falling edge selection</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Both-edge selection</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSTEN</name>
              <description>Interrupt Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Output via the Edge selector</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Direct output</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COE</name>
              <description>Comparator output enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparator output disabled (the output signal is low level).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparator output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINV</name>
              <description>Comparator output polarity selection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparator output not inverted </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparator output inverted</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPSEL0</name>
          <description>Comparator Input Select Register </description>
          <addressOffset>0x004</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CMPSEL</name>
              <description>Comparator Input Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Do not input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Select IVCMP0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Select IVCMP1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Select IVCMP2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Select IVCMP3</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPSEL1</name>
          <description>Comparator Reference Voltage Select Register </description>
          <addressOffset>0x008</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CRVS</name>
              <description>Reference Voltage Selection</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Do not input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Select IVREF0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Select IVREF1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Select IVREF2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Select IVREF3</description>
                  <value>8</value>
                  <name>010000</name>
                  <description>Select IVREF4</description>
                  <value>16</value>
                  <name>100000</name>
                  <description>Select IVREF5</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMON</name>
          <description>Comparator Output Monitor Register </description>
          <addressOffset>0x00C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CMPMON</name>
              <description>Comparator output monitor </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparator output Low</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparator output High</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPIOC</name>
          <description>Comparator Output Control Register </description>
          <addressOffset>0x010</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VREFEN</name>
              <description>Internal Vref enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Internal Vref disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Internal Vref enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOE</name>
              <description>Comparator output selection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>VCOUT pin output of the comparator is disabled (the output signal is low level).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>VCOUT pin output of the comparator is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
