arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
        <register>
          <name>AGTCMSR</name>
          <description>AGT Compare Match Function Select Register</description>
          <addressOffset>0x0E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TOPOLB</name>
              <description>AGTOB polarity select</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AGTOB Output is started at low</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AGTOB Output is started at high</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOEB</name>
              <description>AGTOB output enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AGTOB output disabled (port)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AGTOB output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCMEB</name>
              <description>Compare match B register enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable compare match B register</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable compare match B register</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOPOLA</name>
              <description>AGTOA polarity select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AGTOA Output is started at low</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AGTOA Output is started at high</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOEA</name>
              <description>AGTOA output enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AGTOA output disabled (port)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AGTOA output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCMEA</name>
              <description>Compare match A register enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable compare match A register</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable compare match A register</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AGTIOSEL</name>
          <description>AGT Pin Select Register</description>
          <addressOffset>0x0F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TIES</name>
              <description>AGTIO input enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>External event input is disabled during Software Standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>External event input is enabled during Software Standby mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_AGT0">
      <name>R_AGT1</name>
      <baseAddress>0x40084100</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_BUS</name>
      <description>Bus Interface</description>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x00000002</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000012</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000022</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000032</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000042</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000052</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000062</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000072</offset>
        <size>0x00A</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000802</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000080A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000812</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000081A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000822</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000082A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000832</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000083A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000842</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000084A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000852</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000085A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000862</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000086A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000872</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000087A</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000880</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C00</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C10</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C14</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C20</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C24</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C40</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C44</offset>
        <size>0x006</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000C50</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001000</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001004</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001008</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000100C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001010</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001014</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001100</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001104</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001108</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000110C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001110</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001114</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001118</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000111C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001120</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001124</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001128</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000112C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001130</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001134</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001138</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000113C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001800</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001810</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001820</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001830</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001840</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001850</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001860</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001870</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001880</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001890</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000018A0</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CSa[%s]</name>
          <description>CS Registers</description>
          <addressOffset>0x0000</addressOffset>
          <register>
            <name>MOD</name>
            <description>Mode Register</description>
            <addressOffset>0x0002</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PRMOD</name>
                <description>Page Read Access Mode Select</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Normal access compatible mode</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>External data read continuous assertion mode</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWENB</name>
                <description>Page Write Access Enable</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRENB</name>
                <description>Page Read Access Enable</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EWENB</name>
                <description>External Wait Enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRMOD</name>
                <description>Write Access Mode Select</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Byte strobe mode</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Single write strobe mode</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WCR1</name>
            <description>Wait Control Register 1</description>
            <addressOffset>0x0004</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x07070707</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSRWAIT</name>
                <description>Normal Read Cycle Wait Select</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x00</name>
                    <description>No wait is inserted.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSRWAIT clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSWWAIT</name>
                <description>Normal Write Cycle Wait Select</description>
                <lsb>16</lsb>
                <msb>20</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x00</name>
                    <description>No wait is inserted.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSWWAIT clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSPRWAIT</name>
                <description>Page Read Cycle Wait SelectNOTE: The CSPRWAIT value is valid only when the PRENB bit in CSnMOD is set to 1.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSPRWAIT clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSPWWAIT</name>
                <description>Page Write Cycle Wait SelectNOTE: The CSPWWAIT value is valid only when the PWENB bit in CSnMOD is set to 1.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSPWWAIT clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
