arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
          <register>
            <name>WCR2</name>
            <description>Wait Control Register 2</description>
            <addressOffset>0x0008</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000007</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSON</name>
                <description>CS Assert Wait Select</description>
                <lsb>28</lsb>
                <msb>30</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSON clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WDON</name>
                <description>Write Data Output Wait Select</description>
                <lsb>24</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of WDON clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRON</name>
                <description>WR Assert Wait Select</description>
                <lsb>20</lsb>
                <msb>22</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of WRON clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RDON</name>
                <description>RD Assert Wait Select</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of RDON clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AWAIT</name>
                <description>CS Assert Wait Select</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of AWAIT clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WDOFF</name>
                <description>Write Data Output Extension Cycle Select</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of WDOFF clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSWOFF</name>
                <description>Write-Access CS Extension Cycle Select</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSWOFF clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSROFF</name>
                <description>Read-Access CS Extension Cycle Select</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No wait is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Wait with a length of CSROFF clock cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CSb[%s]</name>
          <description>CS Registers</description>
          <addressOffset>0x0800</addressOffset>
          <register>
            <name>CR</name>
            <description>Control Register</description>
            <addressOffset>0x002</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>MPXEN</name>
                <description>Address/Data Multiplexed I/O Interface Select</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Separate bus interface is selected for area n</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Address/data multiplexed I/O interface is selected for area n. (n = 0 to 7)</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EMODE</name>
                <description>Endian Mode</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Little Endian</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Big Endian</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BSIZE</name>
                <description>External Bus Width Select</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>A 16-bit bus space</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Setting prohibited</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>An 8-bit bus space</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXENB</name>
                <description>Operation Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable operation</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable operation</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>REC</name>
            <description>Recovery Cycle Register</description>
            <addressOffset>0x00A</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>WRCV</name>
                <description>Write Recovery</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No recovery cycle is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>WRCV recovery cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RRCV</name>
                <description>Read Recovery</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>No recovery cycle is inserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>RRCV recovery cycle is inserted.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SDRAM</name>
          <description>SDRAM Registers</description>
          <addressOffset>0x0C00</addressOffset>
          <register>
            <name>SDCCR</name>
            <description>SDC Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>BSIZE</name>
                <description>SDRAM Bus Width Select</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>A 16-bit bus space</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Setting prohibited</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>An 8-bit bus space</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXENB</name>
                <description>Operation Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDCMOD</name>
            <description>SDC Mode Register</description>
            <addressOffset>0x01</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>EMODE</name>
                <description>Endian Mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Endian order of SDRAM address space is the same as the endian order of the operating mode</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Endian order of SDRAM address space is not the endian order of the operating mode.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDAMOD</name>
            <description>SDRAM Access Mode Register</description>
            <addressOffset>0x02</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>BE</name>
                <description>Continuous Access Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDSELF</name>
            <description>SDRAM Self-Refresh Control Register</description>
            <addressOffset>0x10</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>SFEN</name>
                <description>SDRAM Self-Refresh Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDRFCR</name>
            <description>SDRAM Refresh Control Register</description>
            <addressOffset>0x14</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0001</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>REFW</name>
                <description>Auto-Refresh Cycle/ Self-Refresh Clearing Cycle Count Setting. ( REFW+1 Cycles ) </description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>RFC</name>
                <description>Auto-Refresh Request Interval Setting</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>Setting prohibited</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>RFC+1 cycles inserted</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDRFEN</name>
            <description>SDRAM Auto-Refresh Control Register</description>
            <addressOffset>0x16</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>RFEN</name>
                <description>Auto-Refresh Operation Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDICR</name>
            <description>SDRAM Initialization Sequence Control Register</description>
            <addressOffset>0x20</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>INIRQ</name>
                <description>Initialization Sequence Start</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Invalid</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Initialization sequence starts</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
