arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_CTSU</name>
      <description>Capacitive Touch Sensing Unit</description>
      <baseAddress>0x40081000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01E</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTSUCR0</name>
          <description>CTSU Control Register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUTXVSEL</name>
              <description>CTSU Transmission power supply selection</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Select Vcc</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Select internal logic power supply</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUINIT</name>
              <description>CTSU Control Block Initialization</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing a 0 has no effect, this bit is read as 0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>initializes the CTSU control block and registers.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUIOC</name>
              <description>CTSU Transmit Pin Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Low-level output from transmit channel non-measurement pin.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>High-level output from transmit channel non-measurement pin.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUSNZ</name>
              <description>CTSU Wait State Power-Saving Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Power-saving function during wait state is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Power-saving function during wait state is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUCAP</name>
              <description>CTSU Measurement Operation Start Trigger Select</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Software trigger.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>External trigger.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUSTRT</name>
              <description>CTSU Measurement Operation Start</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Measurement operation stops.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Measurement operation starts.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUCR1</name>
          <description>CTSU Control Register 1</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUMD</name>
              <description>CTSU Measurement Mode Select</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Self-capacitance single scan mode</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Self-capacitance multi-scan mode</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Mutual capacitance simple scan mode</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Mutual capacitance full scan mode</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUCLK</name>
              <description>CTSU Operating Clock Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>PCLK</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>PCLK/2 (PCLK divided by 2)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PCLK/2 (PCLK divided by 4)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUATUNE1</name>
              <description>CTSU Power Supply Capacity Adjustment </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal output</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>High-current output</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUATUNE0</name>
              <description>CTSU Power Supply Operating Mode Setting</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operating mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Low-voltage operating mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUCSW</name>
              <description>CTSU LPF Capacitance Charging Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Turned off capacitance switch</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Turned on capacitance switch</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUPON</name>
              <description>CTSU Power Supply Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Powered off the CTSU</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Powered on the CTSU</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSDPRS</name>
          <description>CTSU Synchronous Noise Reduction Setting Register</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUSOFF</name>
              <description>CTSU High-Pass Noise Reduction Function Off Setting</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>High-pass noise reduction function turned on</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>High-pass noise reduction function turned off</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUPRMODE</name>
              <description>CTSU Base Period and Pulse Count Setting</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>510 pulses</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>126 pulses</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>62 pulses (recommended setting value)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUPRRATIO</name>
              <description>CTSU Measurement Time and Pulse Count AdjustmentRecommended setting: 3 (0011b)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSST</name>
          <description>CTSU Sensor Stabilization Wait Control Register </description>
          <addressOffset>0x03</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUSST</name>
              <description>CTSU Sensor Stabilization Wait ControlNOTE: The value of these bits should be fixed to 00010000b.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUMCH0</name>
          <description>CTSU Measurement Channel Register 0</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUMCH0</name>
              <description>CTSU Measurement Channel 0.Note1: Writing to these bits is only enabled in self-capacitance single-scan mode (CTSUCR1.CTSUMD[1:0] bits = 00b).Note2: If  the value of CTSUMCH0 was set to b'111111 in  mode other than self-capacitor single scan mode, the measurement is stopped.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TS0</name>
                  <description>measured TS0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS1</name>
                  <description>measured TS1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS2</name>
                  <description>measured TS2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS3</name>
                  <description>measured TS3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS4</name>
                  <description>measured TS4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS5</name>
                  <description>measured TS5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS6</name>
                  <description>measured TS6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS7</name>
                  <description>measured TS7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS8</name>
                  <description>measured TS8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS9</name>
                  <description>measured TS9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS10</name>
                  <description>measured TS10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS11</name>
                  <description>measured TS11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS12</name>
                  <description>measured TS12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS13</name>
                  <description>measured TS13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS14</name>
                  <description>measured TS14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS15</name>
                  <description>measured TS15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS16</name>
                  <description>measured TS16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS17</name>
                  <description>measured TS17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS18</name>
                  <description>measured TS18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS19</name>
                  <description>measured TS19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS20</name>
                  <description>measured TS20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS21</name>
                  <description>measured TS21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS22</name>
                  <description>measured TS22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS23</name>
                  <description>measured TS23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS24</name>
                  <description>measured TS24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS25</name>
                  <description>measured TS25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS26</name>
                  <description>measured TS26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS27</name>
                  <description>measured TS27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS28</name>
                  <description>measured TS28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS29</name>
                  <description>measured TS29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS30</name>
                  <description>measured TS30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS31</name>
                  <description>measured TS31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS32</name>
                  <description>measured TS32</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS33</name>
                  <description>measured TS33</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS34</name>
                  <description>measured TS34</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS35</name>
                  <description>measured TS35</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Conversion Stopped</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
