arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
        <register>
          <name>CTSUCRB</name>
          <description>CTSU Control Register B</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>PRRATIO</name>
              <description>CTSU Measurement Time and Pulse Count Adjustment</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRMODE</name>
              <description>CTSU Base Period and Pulse Count Setting</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>510 pulses (512 pulses when PROFF bit is 1)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>126 pulses (128 pulses when PROFF bit is 1)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>62 pulses (recommended setting) (64 pulses when PROFF bit is 1)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFF</name>
              <description>CTSU High-Pass Noise Reduction Function Off Setting</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Turn spectrum diffusion on.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Turn spectrum diffusion off.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROFF</name>
              <description>CTSU Random Number Off Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>There is random number control.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>There is no random number control.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SST</name>
              <description>CTSU Sensor Stabilization Wait Control</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSMOD</name>
              <description>CTSU SUCLK Diffusion Mode Select</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSCNT</name>
              <description>CTSU SUCLK Diffusion Control</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUCRBL</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUSDPRS</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUSST</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCRBH</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUDCLKC</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUMCH</name>
          <description>CTSU Measurement Channel Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00003f3f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MCH0</name>
              <description>CTSU Measurement Channel 0</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>TS00</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>TS02</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>TS04</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>TS05</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>TS06</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>TS07</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>TS08</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>TS09</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>TS10</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>TS11</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>TS12</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>TS13</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>TS14</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>TS15</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>TS16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>TS17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>TS18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x15</name>
                  <description>TS21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x16</name>
                  <description>TS22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x17</name>
                  <description>TS23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>TS24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x19</name>
                  <description>TS25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1A</name>
                  <description>TS26</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1B</name>
                  <description>TS27</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1C</name>
                  <description>TS28</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1D</name>
                  <description>TS29</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1E</name>
                  <description>TS30</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>TS31</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>TS32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x21</name>
                  <description>TS33</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x22</name>
                  <description>TS34</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x23</name>
                  <description>TS35</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3F</name>
                  <description>Measurement is being stopped.</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCH1</name>
              <description>CTSU Measurement Channel 1</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>TS00</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>TS02</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>TS04</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>TS05</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>TS06</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>TS07</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>TS08</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>TS09</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>TS10</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>TS11</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>TS12</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>TS13</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>TS14</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>TS15</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>TS16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>TS17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>TS18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x15</name>
                  <description>TS21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x16</name>
                  <description>TS22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x17</name>
                  <description>TS23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>TS24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x19</name>
                  <description>TS25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1A</name>
                  <description>TS26</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1B</name>
                  <description>TS27</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1C</name>
                  <description>TS28</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1D</name>
                  <description>TS29</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1E</name>
                  <description>TS30</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>TS31</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>TS32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x21</name>
                  <description>TS33</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x22</name>
                  <description>TS34</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x23</name>
                  <description>TS35</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3F</name>
                  <description>Measurement is being stopped.</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA0</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA1</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA2</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA3</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUMCHL</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUMCH0</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUMCH1</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
