arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUCHTRCAL</name>
          <description>CTSU Channel Transmit/Receive Control Register A</description>
          <alternateRegister>CTSUCHTRCA</alternateRegister>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRC0</name>
          <description>CTSU Channel Transmit/Receive Control Register A</description>
          <alternateRegister>CTSUCHTRCA</alternateRegister>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRC1</name>
          <description>CTSU Channel Transmit/Receive Control Register A</description>
          <alternateRegister>CTSUCHTRCA</alternateRegister>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRCAH</name>
          <description>CTSU Channel Transmit/Receive Control Register A</description>
          <alternateRegister>CTSUCHTRCA</alternateRegister>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRC2</name>
          <description>CTSU Channel Transmit/Receive Control Register A</description>
          <alternateRegister>CTSUCHTRCAH</alternateRegister>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRC3</name>
          <description>CTSU Channel Transmit/Receive Control Register A</description>
          <alternateRegister>CTSUCHTRCA</alternateRegister>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRCB</name>
          <description>CTSU Channel Transmit/Receive Control Register B</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>CHTRC32</name>
              <description>CTSU Channel Transmit/Receive Control B</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Reception</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHTRC33</name>
              <description>CTSU Channel Transmit/Receive Control B</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Reception</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHTRC34</name>
              <description>CTSU Channel Transmit/Receive Control B</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Reception</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHTRC35</name>
              <description>CTSU Channel Transmit/Receive Control B</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Reception</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUCHTRCBL</name>
          <description>CTSU Channel Transmit/Receive Control Register B</description>
          <alternateRegister>CTSUCHTRCB</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUCHTRC4</name>
          <description>CTSU Channel Transmit/Receive Control Register B</description>
          <alternateRegister>CTSUCHTRCB</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUSR</name>
          <description>CTSU Status Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MFC</name>
              <description>CTSU Multi-clock Counter</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Multi-clock 0</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Multi-clock 1</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Multi-clock 2</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Multi-clock 3</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICOMPRST</name>
              <description>CTSU CTSUICOMP1 Flag Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ICOMP1</name>
              <description>CTSU Sense Current Error Monitor</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal sensor current</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Abnormal sensor current</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICOMP0</name>
              <description>TSCAP Voltage Error Monitor</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal TSCAP voltage</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Abnormal TSCAP voltage</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STC</name>
              <description>CTSU Measurement Status Counter</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Status 0</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Status 1</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Status 2</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Status 3</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Status 4</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Status 5</description>
                  <value>#101</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTSR</name>
              <description>CTSU Data Transfer Status Flag</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Read</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Not read</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSOVF</name>
              <description>CTSU Sensor Counter Overflow Flag</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow occurred</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Overflow occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS</name>
              <description>CTSU Mutual Capacitance Status Flag</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>First measurement</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Second measurement</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFCRDCH</name>
              <description>CTSU CFC Read Channel Select</description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>TS00</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>TS02 (CFC)</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>TS04</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>TS05</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>TS06</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>TS07</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>TS08 (CFC)</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>TS09 (CFC)</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>TS10 (CFC)</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>TS11 (CFC)</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>TS12 (CFC)</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>TS13 (CFC)</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>TS14 (CFC)</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>TS15 (CFC)</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>TS16 (CFC)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>TS17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>TS18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x15</name>
                  <description>TS21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x16</name>
                  <description>TS22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x17</name>
                  <description>TS23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>TS24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x19</name>
                  <description>TS25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1A</name>
                  <description>TS26 (CFC)</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1B</name>
                  <description>TS27 (CFC)</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1C</name>
                  <description>TS28 (CFC)</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1D</name>
                  <description>TS29 (CFC)</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1E</name>
                  <description>TS30 (CFC)</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>TS31 (CFC)</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>TS32 (CFC)</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x21</name>
                  <description>TS33 (CFC)</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x22</name>
                  <description>TS34 (CFC)</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x23</name>
                  <description>TS35 (CFC)</description>
                  <value>0x23</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSRL</name>
          <description>CTSU Status Register</description>
          <alternateRegister>CTSUSR</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUSR0</name>
          <description>CTSU Status Register</description>
          <alternateRegister>CTSUSR</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUST</name>
          <description>CTSU Status Register</description>
          <alternateRegister>CTSUSR</alternateRegister>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUSRH</name>
          <description>CTSU Status Register</description>
          <alternateRegister>CTSUSR</alternateRegister>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUSR2</name>
          <description>CTSU Status Register</description>
          <alternateRegister>CTSUSRH</alternateRegister>
          <addressOffset>0x1E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUSO</name>
          <description>CTSU Sensor Offset Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>SO</name>
              <description>CTSU Sensor Offset Adjustment</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SNUM</name>
              <description>CTSU Measurement Count Setting</description>
              <lsb>10</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSDIV</name>
              <description>CTSU Spectrum Diffusion Frequency Division Setting</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SDPA</name>
              <description>CTSU Base Clock Setting</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSO0</name>
          <description>CTSU Sensor Offset Register</description>
          <alternateRegister>CTSUSO</alternateRegister>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
