arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_DALI0</name>
      <description>Digital Addressable Lighting Interface</description>
      <baseAddress>0x4008F000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001E</offset>
        <size>0x006</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000026</offset>
        <size>0x004</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000002E</offset>
        <size>0x006</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000036</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000003A</offset>
        <size>0x004</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BTVTHR1</name>
          <description>DALI Bit Timing Violation Threshold Register 1</description>
          <addressOffset>0x000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4F00</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BTV2</name>
              <description>Bit Timing Violation Threshold 2Specifies the bit timing violation threshold value 2.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTV1</name>
              <description>Bit Timing Violation Threshold 1Specifies the bit timing violation threshold value 1.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTVTHR2</name>
          <description>DALI Bit Timing Violation Threshold Register 2</description>
          <addressOffset>0x002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x654F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BTV4</name>
              <description>Bit Timing Violation Threshold 4Specifies the bit timing violation threshold value 4.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTV3</name>
              <description>Bit Timing Violation Threshold 3Specifies the bit timing violation threshold value 3.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTVTHR3</name>
          <description>DALI Bit Timing Violation Threshold Register 3</description>
          <addressOffset>0x004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x009D</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BTV5</name>
              <description>Bit Timing Violation Threshold 5Specifies the bit timing violation threshold value 5.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTVTHR4</name>
          <description>DALI Bit Timing Violation Threshold Register 4</description>
          <addressOffset>0x006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00DB</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BTV6</name>
              <description>Bit Timing Violation Threshold 6Specifies the bit timing violation threshold value 6.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLTHR1</name>
          <description>DALI Collision Threshold Register 1</description>
          <addressOffset>0x008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x380F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COL2</name>
              <description>Collision Threshold 2Specifies the collision threshold value 2.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COL1</name>
              <description>Collision Threshold 1Specifies the collision threshold value 1.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLTHR2</name>
          <description>DALI Collision Threshold Register 2</description>
          <addressOffset>0x00A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x443C</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COL4</name>
              <description>Collision Threshold 4Specifies the collision threshold value 4.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COL3</name>
              <description>Collision Threshold 3Specifies the collision threshold value 3.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLTHR3</name>
          <description>DALI Collision Threshold Register 3</description>
          <addressOffset>0x00C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7148</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COL6</name>
              <description>Collision Threshold 6Specifies the collision threshold value 6.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COL5</name>
              <description>Collision Threshold 5Specifies the collision threshold value 5.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLTHR4</name>
          <description>DALI Collision Threshold Register 4</description>
          <addressOffset>0x00E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8879</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COL8</name>
              <description>Collision Threshold 8Specifies the collision threshold value 8.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COL7</name>
              <description>Collision Threshold 7Specifies the collision threshold value 7.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLTHR5</name>
          <description>DALI Collision Threshold Register 5</description>
          <addressOffset>0x010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x008E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COL9</name>
              <description>Collision Threshold 9Specifies the collision threshold value 9.Note 1. These bits must be modified when the DALI0.CTR1.RE bit is 0 and the DALI0.CTR1.TE bit is 0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFR1</name>
          <description>DALI Configuration Register 1</description>
          <addressOffset>0x012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00FF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CHL</name>
              <description>Character Length</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>8 bits</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>16 bits</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>24 bits</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>32 bits</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>20 bits</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>17 bits</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKS</name>
              <description>Clock Select</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>PCLK clock (x = 0)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>PCLK/4 clock (x = 1)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PCLK/16 clock (x = 2)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>PCLK/64 clock (x = 3)</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BR</name>
              <description>Clock SelectBit rate setting example is shown in Table</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFR2</name>
          <description>DALI Configuration Register 2</description>
          <addressOffset>0x014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CDM0</name>
              <description>Collision Detect ModeNote: The bit must be modified only when the DALI0.STR1.BBF bit is 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Destroy area</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Destroy area and avoidance area (edge)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDE</name>
              <description>Collision Detect EnableNote: The bit must be modified only when the DALI0.STR1.BBF bit is 0.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Collision detection is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Collision detection is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXWE</name>
              <description>DTX Width Modulation EnableNote: The bit must be modified only when the DALI0.STR1.BBF bit is 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The width of DTX0 waveform is not modulated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The width of DTX0 waveform is modulated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SGA</name>
              <description>Save an Edge of Gray Area ModeNote: The bit must be modified only when the DALI0.STR1.BBF bit is 0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The edge allowable area of the DRX0 input signal is the default.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The edge allowable area of the DRX0 input signal is extended.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTVM</name>
              <description>Bit Timing Violation ModeNote: The bit must be modified only when the DALI0.STR1.BBF bit is 0.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Edge in gray area between half bit and 2-half bit is not detected as bit timing violation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Edge in gray area between half bit and 2-half bit is detected as bit timing violation.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTVE</name>
              <description>Bit Timing Violation EnableNote: The bit must be modified only when the DALI0.STR1.BBF bit is 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bit timing violation function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bit timing violation function is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXWR1</name>
          <description>DALI DTX Width Register 1</description>
          <addressOffset>0x016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x003F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TXLW</name>
              <description>DTX Low WidthDTX0 pin low level width</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR1H</name>
          <description>DALI Transmit Data Register 1H</description>
          <addressOffset>0x01E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DTDR</name>
              <description>Upper 16-bit DALI transmit data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR1L</name>
          <description>DALI Transmit Data Register 1L</description>
          <addressOffset>0x020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DTDR</name>
              <description>Lower 16-bit DALI transmit data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRSTR1</name>
          <description>DALI Transmit Control Register 1</description>
          <alternateRegister>SPDR</alternateRegister>
          <addressOffset>0x022</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TRST</name>
              <description>Transmission Start Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission Start</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
