arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
        <register>
          <name>STCHSELR</name>
          <description>Time Synchronization Channel Select Register</description>
          <addressOffset>0x06C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSEL</name>
              <description>Timer Information Input SelectNOTE: Do not change the value of this bit while the SYNSTARTR.STR bit is 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Time information from synchronization from the SYNFP0 module is used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Time information from synchronization from the SYNFP1 module is used.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNSTARTR</name>
          <description>Slave Time Synchronization Start Register</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STR</name>
              <description>Slave Time Synchronization Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Slave time synchronization is stopped.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Slave time synchronization is started.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCIVLDR</name>
          <description>Local Time Counter Initial Value Load Directive Register</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Local Time Counter Initial Value Load Directive</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The initial value is not loaded into the local time counter.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The initial value is loaded into the local time counter.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTDARU</name>
          <description>Synchronization Loss Detection Threshold Registers</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNTDARU</name>
              <description>These bits hold the setting for the higher-order 32 bits of the threshold for detection of loss of synchronization.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTDARL</name>
          <description>Synchronization Loss Detection Threshold Registers</description>
          <addressOffset>0x094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNTDARL</name>
              <description>These bits hold the setting for the lower-order 32 bits of the threshold for detection of loss of synchronization.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTDBRU</name>
          <description>Synchronization Detection Threshold Registers</description>
          <addressOffset>0x098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNTDBRU</name>
              <description>These bits hold the setting for the higher-order 32 bits of the threshold for detection of synchronization.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTDBRL</name>
          <description>Synchronization Detection Threshold Registers</description>
          <addressOffset>0x09C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNTDBRL</name>
              <description>These bits hold the setting for the lower-order 32 bits of the threshold for detection of synchronization.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCIVRU</name>
          <description>Local Time Counter Initial Value Registers</description>
          <addressOffset>0x0B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCIVRU</name>
              <description>These bits hold the setting for the higher-order 16 bits of the integer portion of the initial value for the local timer counter.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCIVRM</name>
          <description>Local Time Counter Initial Value Registers</description>
          <addressOffset>0x0B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCIVRM</name>
              <description>These bits hold the setting for the lower-order 32 bits of the integer portion of the initial value for the local timer counter.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCIVRL</name>
          <description>Local Time Counter Initial Value Registers</description>
          <addressOffset>0x0B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCIVRL</name>
              <description>These bits hold the setting for the fractional portion of the initial value of the local timer counter in nanoseconds.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GETW10R</name>
          <description>Worst 10 Acquisition Directive Register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GW10</name>
              <description>Worst 10 Acquisition Directive</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The worst-10 values are not acquired.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts acquisition of the worst-10 values.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLIMITRU</name>
          <description>Positive Gradient Limit Registers</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLIMITRU</name>
              <description>These bits hold the setting for the higher-order 31 bits of the limit for the positive gradient.</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLIMITRM</name>
          <description>Positive Gradient Limit Registers</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLIMITRM</name>
              <description>These bits hold the setting for the middle-order 32 bits of the limit for the positive gradient.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLIMITRL</name>
          <description>Positive Gradient Limit Registers</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLIMITRL</name>
              <description>These bits hold the setting for the lower-order 32 bits of the limit for the positive gradient.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MLIMITRU</name>
          <description>Negative Gradient Limit Registers</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLIMITRU</name>
              <description>These bits hold the setting for the higher-order 31 bits of the limit for the negative gradient.</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MLIMITRM</name>
          <description>Negative Gradient Limit Registers</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLIMITRM</name>
              <description>These bits hold the setting for the middle-order 32 bits of the limit for the negative gradient.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MLIMITRL</name>
          <description>Negative Gradient Limit Registers</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLIMITRL</name>
              <description>These bits hold the setting for the lower-order 32 bits of the limit for the negative gradient.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GETINFOR</name>
          <description>Statistical Information Retention Control Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFO</name>
              <description>Information Retention ControlNOTE: Once information fetching is directed, values of various statistical information read before completion of information fetching are not guaranteed.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Has no effects.(write) / Information retention is completed.(read)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Information is retained.(write) / Processing for information retention is in progress.(read)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCVRU</name>
          <description>Local Time Counters</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCCVRU</name>
              <description>These bits are for reading the higher-order 16 bits of the integer portion of the local timer counter's value.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCVRM</name>
          <description>Local Time Counters</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCCVRM</name>
              <description>These bits are for reading the lower-order 32 bits of the integer portion of the local timer counter's value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCVRL</name>
          <description>Local Time Counters</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCCVRL</name>
              <description>These bits are for reading the fractional portion of the local timer counter's value (in nanoseconds).</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PW10VRU</name>
          <description>Positive Gradient Worst 10 Value Registers</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW10VRU</name>
              <description>These bits are for reading the higher-order 32 bits of the positive gradient value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PW10VRM</name>
          <description>Positive Gradient Worst 10 Value Registers</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW10VRM</name>
              <description>These bits are for reading the middle-order 32 bits of the positive gradient value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PW10VRL</name>
          <description>Positive Gradient Worst 10 Value Registers</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW10VRL</name>
              <description>These bits are for reading the lower-order 32 bits of the positive gradient value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MW10RU</name>
          <description>Negative Gradient Worst 10 Value Registers</description>
          <addressOffset>0x2D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW10RU</name>
              <description>These bits are for reading the higher-order 32 bits of the negative gradient value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MW10RM</name>
          <description>Negative Gradient Worst 10 Value Registers</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW10RM</name>
              <description>These bits are for reading the middle-order 32 bits of the negative gradient value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MW10RL</name>
          <description>Negative Gradient Worst 10 Value Registers</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW10RL</name>
              <description>These bits are for reading the lower-order 32 bits of the negative gradient value.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
