arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
          <register>
            <name>STMON</name>
            <description>System control block Status Monitor Register</description>
            <addressOffset>0x0c</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>L2UNDF</name>
                <description>Graphics 2 underflow detection flag</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>An underflow has been detected in graphics 2.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No underflow has been detected in graphics 2.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L1UNDF</name>
                <description>Graphics 1 underflow detection flag</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>An underflow has been detected in graphics 1.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No underflow has been detected in graphics 1.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VPOS</name>
                <description>Graphics 2 specified line detection flag</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>A specified line notification has been detected in graphics 2.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No specified line notification has been detected in graphics 2.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PANEL_CLK</name>
            <description>System control block Version and Panel Clock Control Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x01000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VER</name>
                <description>
									Version information
									Version information of the GLCDC
								</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PIXSEL</name>
                <description>
									Pixel clock select control.
									Must be set to the same value as OUT_SET.FRQSEL[1].
								</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No frequency division, parallel RGB</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Quarter frequency,serial RGB</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLKSEL</name>
                <description>Panel clock supply source select</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>External clock select</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>PLL output select</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLKEN</name>
                <description>
									Panel clock output enable control
									Note: Before changing the PIXSEL,CLKSEL or DCDR bit, this bit must be set to 0.
								</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disable panel clock output </description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enable panel clock output </description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCDR</name>
                <description>
									Clock division ratio setting control
									Refer toTable 2.7.1 for details about setting value.
									Note: Settings that are not listed in table 2.7.1 are prohibited.
								</description>
                <lsb>0</lsb>
                <msb>5</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>256</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GR1_CLUT0[%s]</name>
          <description>Color Palette 0 Plane for Graphics 1 Plane</description>
          <addressOffset>0x0000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>A</name>
              <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R</name>
              <description>R Value of Color Palette n Plane for Graphics m Plane</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>G</name>
              <description>G Value of Color Palette n Plane for Graphics m Plane</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>B</name>
              <description>B Value of Color Palette n Plane for Graphics m Plane</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="GR1_CLUT0[%s]">
          <name>GR1_CLUT1[%s]</name>
          <description>Color Palette 1 Plane for Graphics 1 Plane</description>
          <addressOffset>0x0400</addressOffset>
          <fields />
        </register>
        <register derivedFrom="GR1_CLUT0[%s]">
          <name>GR2_CLUT0[%s]</name>
          <description>Color Palette 0 Plane for Graphics 2 Plane</description>
          <addressOffset>0x0800</addressOffset>
          <fields />
        </register>
        <register derivedFrom="GR1_CLUT0[%s]">
          <name>GR2_CLUT1[%s]</name>
          <description>Color Palette 1 Plane for Graphics 2 Plane</description>
          <addressOffset>0x0C00</addressOffset>
          <fields />
        </register>
