arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
        <register>
          <name>JIFDCNT</name>
          <description>JPEG Interface Decompression Control Register </description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VINTER</name>
              <description>Vertical SubsamplingSubsamples vertical output image data. </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>No subsampling </description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Subsamples output data into 1/2. </description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Subsamples output data into 1/4. </description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Subsamples output data into 1/8.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HINTER</name>
              <description>Horizontal Subsampling Subsamples horizontal output image data.</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>No subsampling </description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Subsamples output data into 1/2. </description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Subsamples output data into 1/4. </description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Subsamples output data into 1/8.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPF</name>
              <description>Specifies output image data pixel format.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>01</name>
                  <description>ARGB8888 </description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>RGB565 </description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JINRINI</name>
              <description>Address Initialization when Input Coded Data is Resumed This bit is only valid when the count mode for stopping the input of coded data is on. Set this bit before writing 1 to the data resume command bit. </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The transfer address is not initialized when the input of coded data is restarted. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The transfer address is initialized when the input of coded data is restarted.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JINRCMD</name>
              <description>Input Coded Data Resume CommandThis bit is valid only when the count mode for stopping the input of coded data is on. Setting this bit to 1 resumes reading input coded data. This bit is always read as 0.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>JINC</name>
              <description>Count Mode Setting for Stopping Input Coded Data </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Count mode for stopping the input of coded data is off. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Count mode for stopping the input of coded data is on</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JINSWAP</name>
              <description>Byte/Word/Longword Swap Input coded data in decompression is swapped. </description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>(1) (2) (3) (4) (5) (6) (7) (8) </description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>(2) (1) (4) (3) (6) (5) (8) (7) [Byte swap] </description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>(3) (4) (1) (2) (7) (8) (5) (6)  [Halfword swap] </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>(4) (3) (2) (1) (8) (7) (6) (5) [Halfword - byte swap] </description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>(5) (6) (7) (8) (1) (2) (3) (4) [Word swap] </description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>(6) (5) (8) (7) (2) (1) (4) (3) [Word - byte swap] </description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>(7) (8) (5) (6) (3) (4) (1) (2) [Word -Halfword swap] </description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>(8) (7) (6) (5) (4) (3) (2) (1) [Word - Halfword - byte swap]</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUTRINI</name>
              <description>Address Initialization when Resuming Output of Image Data Lines This bit is only valid when the count mode for stopping the output of image data lines is on. Set this bit before writing 1 to the data-line resume command bit. </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The transfer address is not initialized when the output of lines of image data is restarted. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The transfer address is initialized when the output of lines of image data is restarted</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUTRCMD</name>
              <description>Output Image Data Lines Resume Command This bit is valid only when the count mode for stopping the output of image data lines is on. Setting this bit to 1 resumes writing image data. This bit is always read as 0. </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DOUTLC</name>
              <description>Count Mode for Stopping Output Image Data Lines</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Count mode for stopping the output of image data lines is off. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Count mode for stopping the output of image data lines is on</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUTSWAP</name>
              <description>Byte/Word Swap Output image data in decompression is swapped. </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>(1) (2) (3) (4) (5) (6) (7) (8) </description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>(2) (1) (4) (3) (6) (5) (8) (7) [Byte swap] </description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>(3) (4) (1) (2) (7) (8) (5) (6)  [Halfword swap] </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>(4) (3) (2) (1) (8) (7) (6) (5) [Halfword - byte swap] </description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>(5) (6) (7) (8) (1) (2) (3) (4) [Word swap] </description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>(6) (5) (8) (7) (2) (1) (4) (3) [Word - byte swap] </description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>(7) (8) (5) (6) (3) (4) (1) (2) [Word - Halfword swap] </description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>(8) (7) (6) (5) (4) (3) (2) (1) [Word - Halfword - byte swap] </description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFDSA</name>
          <description>JPEG Interface Decompression Source Address Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSA</name>
              <description>Input Coded Data Source AddressInput Coded Data Source Address (in 8-byte units) The lower three bits should be set to 0. </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFDDOFST</name>
          <description>JPEG Interface Decompression Line Offset Register</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DDMW</name>
              <description>Output Image Data Lines Offset (in 8-byte units) The lower three bits should be set to 0. </description>
              <lsb>0</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFDDA</name>
          <description>JPEG Interface Decompression Destination Address Register</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DDA</name>
              <description>Output Image Data Destination Address (in 8-byte units) The lower three bits should be set to 0. </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFDSDC</name>
          <description>JPEG Interface Decompression Source Data Count Register</description>
          <addressOffset>0x068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF8FFF8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JDATAS</name>
              <description> Amount of Input Coded Data to be Read (in 8-byte units) The lower three bits should be set to 0. </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFDDLC</name>
          <description>JPEG Interface Decompression Destination Line Count Register</description>
          <addressOffset>0x06C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF8FFF8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINES</name>
              <description>Number of Input Image Lines to Be ReadThe lower three bits should be set to 0. These bits are read as0.Number of input image data lines to be read, in 8-line units.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFDADT</name>
          <description>JPEG Interface Decompression alpha Set Register </description>
          <addressOffset>0x070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALPHA</name>
              <description>Setting of the alpha value for output in ARGB8888 format.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JINTE1</name>
          <description>JPEG Interrupt Enable Register 1</description>
          <addressOffset>0x08C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBTEN</name>
              <description> Enables or disables a data transfer processing interrupt request (JDTI) when the CBTF bit in JINTS1 is set to 1. </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables an interrupt request. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables an interrupt request. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINLEN</name>
              <description> Enables or disables a data transfer processing interrupt request (JDTI) when the DINLF bit in JINTS1 is set to 1.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables an interrupt request. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables an interrupt request. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBTEN</name>
              <description>Enables or disables a data transfer processing interrupt request (JDTI) when the DBTF bit in JINTS1 is set to 1.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables an interrupt request. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables an interrupt request. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JINEN</name>
              <description>Enables or disables a data transfer processing interrupt request (JDTI) when the JINF bit in JINTS1 is set to 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables an interrupt request. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables an interrupt request. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUTLEN</name>
              <description>Enables or disables a data transfer processing interrupt request (JDTI) when the DOUTLF bit in JINTS1 is set to 1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables an interrupt request. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables an interrupt request.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JINTS1</name>
          <description>JPEG Interrupt Status Register 1</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBTF</name>
              <description> This bit is set to 1 when the last output coded data is written in compression.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>DINLF</name>
              <description>This bit is set to 1 when the number of input image data lines indicated by JIFESLC is read in compression.  This bit is valid only when the DINLC bit in JIFECNT is set to 1. </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>DBTF</name>
              <description> This bit is set to 1 when the last output image data is written in decompression. </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>JINF</name>
              <description> This bit is set to 1 when the amount of input coded data indicated by JIFDSDC is read in decompression.  This bit is valid only when the JINC bit in JIFDCNT is set to 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>DOUTLF</name>
              <description>In decompression, this bit is set to 1 when the number of lines of output image data indicated by JIFDDLC have been written. This bit is only valid when the DOUTLC bit in JIFDCNT is set to 1. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
