arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_MPU_SPMON</name>
      <description>CPU Stack Pointer Monitor</description>
      <baseAddress>0x40000D00</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x00E</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000014</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>M</name>
              <description>M</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P</name>
              <description>P</description>
              <value>1</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>SP[%s]</name>
          <description>Stack Pointer Monitor</description>
          <addressOffset>0x0000</addressOffset>
          <register>
            <name>OAD</name>
            <description>Stack Pointer Monitor Operation After Detection Register</description>
            <addressOffset>0x00</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>Write Keyword The data written to these bits are not stored.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0xA5</name>
                    <description>Writing to the OAD bit is valid, when the KEY bits are written 0xA5.</description>
                    <value>0xA5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Writing to the OAD bit is invalid.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OAD</name>
                <description>Operation after detection</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Non-maskable interrupt</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Reset.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTL</name>
            <description>Stack Pointer Monitor Access Control Register</description>
            <addressOffset>0x04</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFEFF</resetMask>
            <fields>
              <field>
                <name>ERROR</name>
                <description>Stack Pointer Monitor Error Flag</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Stack pointer has not overflowed or underflowed</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Stack pointer has overflowed or underflowed</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Stack Pointer Monitor Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Stack pointer monitor is disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Stack pointer monitor is enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PT</name>
            <description>Stack Pointer Monitor Protection Register</description>
            <addressOffset>0x06</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>Write Keyword The data written to these bits are not stored.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0xA5</name>
                    <description>Writing to the PROTECT bit is valid, when the KEY bits are written 0xA5.</description>
                    <value>0xA5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Writing to the PROTECT bit is invalid.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PROTECT</name>
                <description>Protection of register (MSPMPUAC, MSPMPUSA and MSPMPUSE)</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Stack Pointer Monitor register writing is possible.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Stack Pointer Monitor register writing is protected.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SA</name>
            <description>Stack Pointer Monitor Start Address Register</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000003</resetMask>
            <fields>
              <field>
                <name>MSPMPUSA</name>
                <description>Region start address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00000-0x200FFFFC         The low-order 2 bits are fixed to 0.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x1FF00000</minimum>
                    <maximum>0x200FFFFC</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
          <register>
            <name>EA</name>
            <description>Stack Pointer Monitor End Address Register</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <resetMask>0x00000003</resetMask>
            <fields>
              <field>
                <name>MSPMPUEA</name>
                <description>Region end address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00003-0x200FFFFF         The low-order 2 bits are fixed to 1.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x1FF00003</minimum>
                    <maximum>0x200FFFFF</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
        </cluster>
