arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_OPAMP</name>
      <description>Operational Amplifier</description>
      <baseAddress>0x40086000</baseAddress>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000000E</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001F</offset>
        <size>0x007</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x3</dimIncrement>
          <name>AMPIO[%s]</name>
          <description>Input and Output Selectors for Operational Amplifier %s</description>
          <addressOffset>0x0E</addressOffset>
          <access>read-write</access>
          <register>
            <name>O</name>
            <description>Output Select Register </description>
            <addressOffset>0</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields />
          </register>
          <register>
            <name>P</name>
            <description>Plus Input Select Register </description>
            <addressOffset>2</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields />
          </register>
          <register>
            <name>M</name>
            <description>Minus Input Select Register</description>
            <addressOffset>1</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields />
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>2</dimIncrement>
          <name>AMPOT[%s]</name>
          <description>Operational Amplifier n Offset Trimming Registers</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <register>
            <name>P</name>
            <description>Operational Amplifier n Offset Trimming Pch Register</description>
            <addressOffset>0</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xD0</resetMask>
            <fields>
              <field>
                <name>TRMP</name>
                <description>AMPn input offset trimming Pch side</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>N</name>
            <description>Operational Amplifier n Offset Trimming Nch Register</description>
            <addressOffset>1</addressOffset>
            <size>8</size>
            <fields>
              <field>
                <name>TRMN</name>
                <description>AMPn input offset trimming Nch side</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AMPMC</name>
          <description>Operational amplifier mode control register</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>AMPSP</name>
              <description>Operation mode selection</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Low-power mode (low-speed).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>High-speed mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>3</dim>
              <dimIncrement>1</dimIncrement>
              <name>AMPPC%s</name>
              <description>Operational amplifier precharge control status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Precharging is stopped.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Precharging is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPTRM</name>
          <description>Operational amplifier trigger mode control register</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <name>AMPTRM%s</name>
              <description>Operational amplifier function activation/stop trigger control </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Software trigger mode.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>An activation and A/D trigger mode.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Setting prohibited.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>An activation and A/D trigger mode.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPTRS</name>
          <description>Operational Amplifier Activation Trigger Select Register</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>AMPTRS</name>
              <description>ELC trigger selection Do not change the value of the AMPTRS register after setting the AMPTRM register. </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Operational amplifier 0: Operational amplifier An activation trigger 0.Operational amplifier 1: Operational amplifier An activation trigger 1.Operational amplifier 2: Operational amplifier An activation trigger 2.Operational amplifier 3: Operational amplifier An activation trigger 3</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Operational amplifier 0: Operational amplifier An activation trigger 0.Operational amplifier 1: Operational amplifier An activation trigger 0.Operational amplifier 2: Operational amplifier An activation trigger 1.Operational amplifier 3: Operational amplifier An activation trigger 1</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Setting prohibited</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Operational amplifier 0: Operational amplifier An activation trigger 0.Operational amplifier 1: Operational amplifier An activation trigger 0.Operational amplifier 2: Operational amplifier An activation trigger 0.Operational amplifier 3: Operational amplifier An activation trigger 0</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPC</name>
          <description>Operational amplifier control register</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IREFE</name>
              <description>Operation control of operational amplifier reference current circuit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Operational amplifier reference current circuit is stopped.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Operation of operational amplifier reference current circuit is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>1</dimIncrement>
              <name>AMPE%s</name>
              <description>Operation control of operational amplifier</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Operation amplifier is stopped.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Software trigger mode: Operation of operational amplifier is enabled Operation of the operational amplifier reference current circuit is also enabled regardless of the IREFE bit se An activation trigger mode or An activation and A/D trigger mode: Wait for An activation is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPMON</name>
          <description>Operational amplifier monitor register</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>1</dimIncrement>
              <name>AMPMON%s</name>
              <description>Operational amplifier status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Operational amplifier is stopped.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Operational amplifier is operating.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPUOTE</name>
          <description>Operational Amplifier User Offset Trimming Enable Register</description>
          <addressOffset>0x1F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <dim>3</dim>
              <dimIncrement>1</dimIncrement>
              <name>AMP%sTE</name>
              <description>AMP%sOT write enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not possible to write the AMPnOTP and AMPnOTN registers</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Possible to write the AMPnOTP and AMPnOTN registers</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
