arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT1</name>
      <baseAddress>0x40040020</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT2</name>
      <baseAddress>0x40040040</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT3</name>
      <baseAddress>0x40040060</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT4</name>
      <baseAddress>0x40040080</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT5</name>
      <baseAddress>0x400400A0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT6</name>
      <baseAddress>0x400400C0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT7</name>
      <baseAddress>0x400400E0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT8</name>
      <baseAddress>0x40040100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT9</name>
      <baseAddress>0x40040120</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT10</name>
      <baseAddress>0x40040140</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_PORT0">
      <name>R_PORT11</name>
      <baseAddress>0x40040160</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_PFS</name>
      <description>I/O Ports-PFS</description>
      <baseAddress>0x40040800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x040</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>12</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>PORT[%s]</name>
          <description>Port %s</description>
          <cluster>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <name>PIN[%s]</name>
          <description>Pin Function Selects</description>
          <addressOffset>0</addressOffset>
          <register>
            <name>PmnPFS_BY</name>
            <description>Pin Function Control Register</description>
            <addressOffset>0x003</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFD</resetMask>
            <fields>
              <field>
                <name>NCODR</name>
                <description>N-Channel Open Drain Control</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>CMOS output</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>NMOS open-drain output</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PIM</name>
                <description>Port Input Mode Control</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>CMOS input</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>TTL input</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PCR</name>
                <description>Pull-up Control</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables an input pull-up.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables an input pull-up.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PDR</name>
                <description>Port Direction</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Input (Functions as an input pin.)</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Output (Functions as an output pin.)</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PIDR</name>
                <description>Port Input Data</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Low input</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>High input</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PODR</name>
                <description>Port Output Data</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Low output</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>High output</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
