arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
          <register derivedFrom="PmnPFS_BY">
            <name>PmnPFS_HA</name>
            <description>Pin Function Control Register</description>
            <addressOffset>0x002</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFD</resetMask>
            <fields>
              <field>
                <name>ASEL</name>
                <description>Analog Input enable</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Used other than as analog pin</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Used as analog pin</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ISEL</name>
                <description>IRQ input enable</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Not used as IRQn input pin</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Used as IRQn input pin</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EOFR</name>
                <description>Event on Falling/Rising</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>Do not care</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Detect rising edge</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Detect falling edge</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Detect rising and falling edge</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DSCR</name>
                <description>Drive Strength Control Register</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>Normal drive output</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Middle drive output</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Middle drive with IIC</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>High-drive output</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register derivedFrom="PmnPFS_HA">
            <name>PmnPFS</name>
            <description>Pin Function Control Register</description>
            <addressOffset>0x000</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFD</resetMask>
            <fields>
              <field>
                <name>PSEL</name>
                <description>Port Function SelectThese bits select the peripheral function. For individual pin functions, see the MPC table</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PMR</name>
                <description>Port Mode Control</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Uses the pin as a general I/O pin. </description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Uses the pin as an I/O port for peripheral functions.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>R_PMISC</name>
      <description>I/O Ports-MISC</description>
      <baseAddress>0x40040D00</baseAddress>
      <addressBlock>
        <offset>0x00000003</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PFENET</name>
          <description>Ethernet Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 00. The write value should be 00.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYMODE1</name>
              <description>Ethernet Mode Setting ch1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RMII mode (ETHERC channel 1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MII mode (ETHERC channel 1)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYMODE0</name>
              <description>Ethernet Mode Setting ch0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RMII mode (ETHERC channel 0)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MII mode (ETHERC channel 0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000. The write value should be 0000.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWPR</name>
          <description>Write-Protect Register </description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PFSWE</name>
              <description>PmnPFS Register Write</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing to the PmnPFS register is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing to the PmnPFS register is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B0WI</name>
              <description>PFSWE Bit Write Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing to the PFSWE bit is enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing to the PFSWE bit is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
