arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_SPI0">
      <name>R_SPI1</name>
      <baseAddress>0x40072100</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_SRAM</name>
      <description>SRAM</description>
      <baseAddress>0x40002000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000C0</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000D0</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000D4</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000D8</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PARIOAD</name>
          <description>SRAM Parity Error Operation After Detection Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>OAD</name>
              <description>Operation after Detection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Reset</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>Non maskable interrupt.</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMPRCR</name>
          <description>SRAM Protection Register</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KW</name>
              <description>Write Key Code</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1111000</name>
                  <description>Writing to the RAMPRCR bit is valid, when the KEY bits are written 1111000b.</description>
                  <value>#1111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the RAMPRCR bit is invalid.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMPRCR</name>
              <description>Register Write Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable writes to protected registers</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable writes to protected registers.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMWTSC</name>
          <description>RAM Wait State Control Register</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0E</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SRAMHSWTEN</name>
              <description>SRAMHS Wait Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not add wait state in read access cycle to SRAMHS</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Add wait state in read access cycle to SRAMHS</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1WTEN</name>
              <description>SRAM1 Wait Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not add wait state in read access cycle to SRAM1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Add wait state in read access cycle to SRAM1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM0WTEN</name>
              <description>SRAM0 Wait Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not add wait state in read access cycle to SRAM0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Add wait state in read access cycle to SRAM0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCRAMRDWTEN</name>
              <description>ECCRAM Read wait enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not add wait state in read access cycle to SRAM0 (ECC area)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Add wait state in read access cycle to SRAM0 (ECC area)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCRAMWRWTEN</name>
              <description>ECCRAM Write Wait Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not add wait state in write access cycle to SRAM0 (ECC area)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Add wait state in write access cycle to SRAM0 (ECC area)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCMODE</name>
          <description>ECC Operating Mode Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ECCMOD</name>
              <description>ECC Operating Mode Select</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Disable ECC function</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Setting prohibited</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Enable ECC function without error checking</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Enable ECC function with error checking</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC2STS</name>
          <description>ECC 2-Bit Error Status Register</description>
          <addressOffset>0xC1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ECC2ERR</name>
              <description>ECC 2-Bit Error Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No 2-bit ECC error occurred</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2-bit ECC error occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC1STSEN</name>
          <description>ECC 1-Bit Error Information Update Enable Register</description>
          <addressOffset>0xC2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>E1STSEN</name>
              <description>ECC 1-Bit Error Information Update Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables updating of the 1-bit ECC error information.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables updating of the 1-bit ECC error information.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC1STS</name>
          <description>ECC 1-Bit Error Status Register</description>
          <addressOffset>0xC3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ECC1ERR</name>
              <description>ECC 1-Bit Error Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No 1-bit ECC error occurred</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1-bit ECC error occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCPRCR</name>
          <description>ECC Protection Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KW</name>
              <description>Write Key Code</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1111000</name>
                  <description>Writing to the ECCRAMPRCR bit is valid, when the KEY bits are written 1111000b.</description>
                  <value>#1111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the ECCRAMPRCR bit is invalid.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCPRCR</name>
              <description>Register Write Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable writes to the protected registers</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable writes to the protected registers</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCPRCR2</name>
          <description>ECC Protection Register 2</description>
          <addressOffset>0xD0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KW2</name>
              <description>Write Key Code</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1111000</name>
                  <description>These bits enable or disable writes to the ECCPRCR2 bit..</description>
                  <value>#1111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the ECCRAMPRCR2 bit is invalid.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCPRCR2</name>
              <description>Register Write Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable writes to the protected registers</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable writes to the protected registers.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCETST</name>
          <description>ECC Test Control Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TSTBYP</name>
              <description>ECC Bypass Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ECC bypass disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ECC bypass enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCOAD</name>
          <description>SRAM ECC Error Operation After Detection Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>OAD</name>
              <description>Operation after Detection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Non-maskable interrupt</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Reset</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
