arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
        <register>
          <name>SRCSTAT</name>
          <description>Status Register</description>
          <addressOffset>0x5FFE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0002</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFDN</name>
              <description>Output FIFO Data CountIndicates the number of data units in the output FIFO.</description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IFDN</name>
              <description>Input FIFO Data CountIndicates the number of data units in the input FIFO.</description>
              <lsb>7</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CEF</name>
              <description>Conversion End Flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>All of the output data has not been read out.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>All of the output data has been read out.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLF</name>
              <description>Flush Processing Status Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Flash processing is completed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Flash processing is in progress.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDF</name>
              <description>Output FIFO Underflow Interrupt Request Flag</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Output data FIFO has not been read out.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Output data FIFO has been read out.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVF</name>
              <description>Output Data FIFO Overwrite Interrupt Request Flag</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Next data conversion processing is not completed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Next data conversion processing is completed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IINT</name>
              <description>Input Data FIFO Empty Interrupt Request Flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Number of data units in the input FIFO has not become equal to or smaller than the specified triggering number.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Number of data units in the input FIFO has become equal to or smaller than the specified triggering number.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OINT</name>
              <description>Output Data FIFO Full Interrupt Request Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Number of data units in the output FIFO has not become equal to or greater than the specified triggering number.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Number of data units in the output FIFO has become equal to or greater than the specified triggering number.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
