arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
      </registers>
    </peripheral>
    <peripheral>
        <name>R_SSI0</name>
        <description>Serial Sound Interface Enhanced (SSIE)</description>
        <baseAddress>0x4004E000</baseAddress>
        <addressBlock>
            <offset>0x00</offset>
            <size>8</size>
            <usage>registers</usage>
        </addressBlock>
        <addressBlock>
            <offset>0x10</offset>
            <size>24</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>SSICR</name>
                <description>Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0xFFFFFFFF</resetMask>
                <fields>
                    <field>
                        <name>CKS</name>
                        <description>Oversampling Clock Select</description>
                        <lsb>30</lsb>
                        <msb>30</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>AUDIO_CLK input</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Setting prohibited</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TUIEN</name>
                        <description>Transmit Underflow Interrupt Enable</description>
                        <lsb>29</lsb>
                        <msb>29</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables an underflow interrupt.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables an underflow interrupt.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TOIEN</name>
                        <description>Transmit Overflow Interrupt Enable</description>
                        <lsb>28</lsb>
                        <msb>28</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables an overflow interrupt.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables an overflow interrupt.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RUIEN</name>
                        <description>Receive Underflow Interrupt Enable</description>
                        <lsb>27</lsb>
                        <msb>27</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables an underflow interrupt.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables an underflow interrupt.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ROIEN</name>
                        <description>Receive Overflow Interrupt Enable</description>
                        <lsb>26</lsb>
                        <msb>26</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables an overflow interrupt.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables an overflow interrupt.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IIEN</name>
                        <description>Idle Mode Interrupt Enable</description>
                        <lsb>25</lsb>
                        <msb>25</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables an idle mode interrupt.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables an idle mode interrupt.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FRM</name>
                        <description>Channels</description>
                        <lsb>22</lsb>
                        <msb>23</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>00</name>
                                <description>One channel</description>
                                <value>#00</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>others</name>
                                <description>Settings other than above are prohibited.</description>
                                <isDefault>true</isDefault>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DWL</name>
                        <description>Data Word Length</description>
                        <lsb>19</lsb>
                        <msb>21</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>000</name>
                                <description>8 bits</description>
                                <value>#000</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>001</name>
                                <description>16 bits</description>
                                <value>#001</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>010</name>
                                <description>18 bits</description>
                                <value>#010</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>011</name>
                                <description>20 bits</description>
                                <value>#011</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>100</name>
                                <description>22 bits</description>
                                <value>#100</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>101</name>
                                <description>24 bits</description>
                                <value>#101</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>others</name>
                                <description>Settings other than above are prohibited.</description>
                                <isDefault>true</isDefault>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SWL</name>
                        <description>System Word LengthSet the system word length to the bit clock frequency/2 fs.</description>
                        <lsb>16</lsb>
                        <msb>18</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>000</name>
                                <description>8 bits (serial bit clock frequency = 16fs )</description>
                                <value>#000</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>001</name>
                                <description>16 bits (serial bit clock frequency = 32fs )</description>
                                <value>#001</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>010</name>
                                <description>24 bits (serial bit clock frequency = 48fs )</description>
                                <value>#010</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>011</name>
                                <description>32 bits (serial bit clock frequency = 64fs )</description>
                                <value>#011</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>others</name>
                                <description>Settings other than above are prohibited.</description>
                                <isDefault>true</isDefault>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MST</name>
                        <description>Serial WS Direction NOTE: Only the following settings are allowed: (SCKD, SWSD) = (0, 0) and (1, 1). Other settings are prohibited.</description>
                        <lsb>14</lsb>
                        <msb>14</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Serial word select is input, slave mode.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Serial word select is output, master mode.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BCKP</name>
                        <description>Serial Bit Clock Polarity</description>
                        <lsb>13</lsb>
                        <msb>13</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>SSIWS and SSIDATA change at the SSISCK falling edge (sampled at the SCK rising edge).</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>SSIWS and SSIDATA change at the SSISCK rising edge (sampled at the SCK falling edge).</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LRCKP</name>
                        <description>Serial WS Polarity</description>
                        <lsb>12</lsb>
                        <msb>12</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>SSIWS is low for 1st channel, high for 2nd channel.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>SSIWS is high for 1st channel, low for 2nd channel.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SPDP</name>
                        <description>Serial Padding Polarity</description>
                        <lsb>11</lsb>
                        <msb>11</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Padding bits are low.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Padding bits are high.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SDTA</name>
                        <description>Serial Data Alignment</description>
                        <lsb>10</lsb>
                        <msb>10</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Transmitting and receiving in the order of serial data and padding bits</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Transmitting and receiving in the order of padding bits and serial data</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PDTA</name>
                        <description>Parallel Data Alignment</description>
                        <lsb>9</lsb>
                        <msb>9</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>The lower bits of parallel data (SSITDR, SSIRDR) are transferred prior to the upper bits.(When data word length is 8 or 16 bits) / Parallel data (SSITDR, SSIRDR) is left-aligned.(When data word length is 18, 20, 22, or 24 bits)</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>The upper bits of parallel data (SSITDR, SSIRDR) are transferred prior to the lower bits.(When data word length is 8 or 16 bits) / Parallel data (SSITDR, SSIRDR) is right-aligned.(When data word length is 18, 20, 22, or 24 bits)</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DEL</name>
                        <description>Serial Data Delay</description>
                        <lsb>8</lsb>
                        <msb>8</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>1 clock cycle delay between SSIWS and SSIDATA</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>No delay between SSIWS and SSIDATA</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CKDV</name>
                        <description>Serial Oversampling Clock Division Ratio</description>
                        <lsb>4</lsb>
                        <msb>7</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0x0</name>
                                <description>CLK</description>
                                <value>0x0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x1</name>
                                <description>CLK/2</description>
                                <value>0x1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x2</name>
                                <description>CLK/4</description>
                                <value>0x2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x3</name>
                                <description>CLK/8</description>
                                <value>0x3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x4</name>
                                <description>CLK/16</description>
                                <value>0x4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x5</name>
                                <description>CLK/32</description>
                                <value>0x5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x6</name>
                                <description>CLK/64</description>
                                <value>0x6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x7</name>
                                <description>CLK/128</description>
                                <value>0x7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x8</name>
                                <description>CLK/6</description>
                                <value>0x8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0x9</name>
                                <description>CLK/12 (These bits are only settable for channel 0. Setting these bits in the register for channel 1 is prohibited.)</description>
                                <value>0x9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0xA</name>
                                <description>CLK/24</description>
                                <value>0xA</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0xB</name>
                                <description>CLK/48(These bits are only settable for channel 0. Setting these bits in the register for channel 1 is prohibited.)</description>
                                <value>0xB</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>0xC</name>
                                <description>CLK/96(These bits are only settable for channel 0. Setting these bits in the register for channel 1 is prohibited.)</description>
                                <value>0xC</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>others</name>
                                <description>Settings other than above are prohibited.</description>
                                <isDefault>true</isDefault>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MUEN</name>
                        <description>Mute EnableNOTE: When this module is muted, the value of outputting serial data is rewritten to 0 but data transmission is not stopped. Write dummy data to the SSIFTDR not to generate a transmit underflow because the number of data in the transmit FIFO is decreasing.</description>
                        <lsb>3</lsb>
                        <msb>3</msb>
