arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>This module is not muted.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>This module is muted.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TEN</name>
                        <description>Transmit Enable</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables the transmit operation.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables the transmit operation.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REN</name>
                        <description>Receive Enable</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables the receive operation.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables the receive operation.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSISR</name>
                <description>Status Register</description>
                <addressOffset>0x04</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0x02000013</resetValue>
                <resetMask>0x3E00007F</resetMask>
                <fields>
                    <field>
                        <name>TUIRQ</name>
                        <description>Transmit Underflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                        <lsb>29</lsb>
                        <msb>29</msb>
                        <access>read-write</access>
                        <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                        <readAction>modify</readAction>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>No transmit underflow has occurred.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>A transmit underflow has occurred.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TOIRQ</name>
                        <description>Transmit Overflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                        <lsb>28</lsb>
                        <msb>28</msb>
                        <access>read-write</access>
                        <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                        <readAction>modify</readAction>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>No transmit overflow has occurred.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>A transmit overflow has occurred.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RUIRQ</name>
                        <description>Receive Underflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                        <lsb>27</lsb>
                        <msb>27</msb>
                        <access>read-write</access>
                        <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                        <readAction>modify</readAction>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>No receive underflow has occurred.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>A receive underflow has occurred.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ROIRQ</name>
                        <description>Receive Overflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                        <lsb>26</lsb>
                        <msb>26</msb>
                        <access>read-write</access>
                        <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                        <readAction>modify</readAction>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>No receive overflow has occurred.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>A receive overflow has occurred.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IIRQ</name>
                        <description>Idle Mode Interrupt Status Flag</description>
                        <lsb>25</lsb>
                        <msb>25</msb>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>This module is not in idle state.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>This module is in idle state.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TCHNO</name>
                        <description>Transmit Channel Number</description>
                        <lsb>5</lsb>
                        <msb>6</msb>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TSWNO</name>
                        <description>Transmit Serial Word Number</description>
                        <lsb>4</lsb>
                        <msb>4</msb>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RCHNO</name>
                        <description>Receive Channel Number.These bits are read as 00b.</description>
                        <lsb>2</lsb>
                        <msb>3</msb>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RSWNO</name>
                        <description>Receive Serial Word Number</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IDST</name>
                        <description>Idle Mode Status Flag</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Serial bus is operating.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>The current communication is stopped.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSIFCR</name>
                <description>FIFO Control Register</description>
                <addressOffset>0x10</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0xFFFFFFFF</resetMask>
                <fields>
                    <field>
                        <name>AUCKE</name>
                        <description>Oversampling Clock Enable</description>
                        <lsb>31</lsb>
                        <msb>31</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>The oversampling clock is disabled.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>The oversampling clock is enabled.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SSIRST</name>
                        <description>SSI soft ware reset</description>
                        <lsb>16</lsb>
                        <msb>16</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Clears the SSI software reset.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>initiates the SSI software reset.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TTRG</name>
                        <description>Transmit Data Trigger Number NOTE: The values in parenthesis are the number of empty stages in SSIFTDR at which the TDE flag is set.</description>
                        <lsb>6</lsb>
                        <msb>7</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>00</name>
                                <description>7 (1)</description>
                                <value>#00</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>01</name>
                                <description>6 (2)</description>
                                <value>#01</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>10</name>
                                <description>4 (4)</description>
                                <value>#10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11</name>
                                <description>2 (6)</description>
                                <value>#11</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RTRG</name>
                        <description>Receive Data Trigger Number</description>
                        <lsb>4</lsb>
                        <msb>5</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>00</name>
                                <description>1</description>
                                <value>#00</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>01</name>
                                <description>2</description>
                                <value>#01</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>10</name>
                                <description>4</description>
                                <value>#10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11</name>
                                <description>6</description>
                                <value>#11</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TIE</name>
                        <description>Transmit Interrupt Enable NOTE: TXI can be cleared by clearing either the TDE flag (see the description of the TDE bit for details) or TIE bit.</description>
                        <lsb>3</lsb>
                        <msb>3</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Transmit data empty interrupt (TXI) request is disabled</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Transmit data empty interrupt (TXI) request is enabled</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RIE</name>
                        <description>Receive Interrupt Enable NOTE: RXI can be cleared by clearing either the RDF flag (see the description of the RDF bit for details) or RIE bit.</description>
                        <lsb>2</lsb>
                        <msb>2</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Receive data full interrupt (RXI) request is disabled</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Receive data full interrupt (RXI) request is enabled</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TFRST</name>
                        <description>Transmit FIFO Data Register Reset</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Clears the transmit data FIFO reset.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Initiates the transmit data FIFO reset.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RFRST</name>
                        <description>Receive FIFO Data Register Reset</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Clears the receive data FIFO reset.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Initiates the receive data FIFO reset.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
