arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
            <register>
                <name>SSIFSR</name>
                <description>FIFO Status Register</description>
                <addressOffset>0x14</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0x00010000</resetValue>
                <resetMask>0xFFFFFFFF</resetMask>
                <fields>
                    <field>
                        <name>TDC</name>
                        <description>Transmit Data Indicate Flag(Indicates the number of data units stored in SSIFTDR)</description>
                        <lsb>24</lsb>
                        <msb>29</msb>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TDE</name>
                        <description>Transmit Data Empty Flag NOTE: Since the SSIFTDR register is a 32-byte FIFO register, the maximum number of bytes that can be written to it while the TDE flag is 1 is 8 - TDC[3:0]. If writing data to the SSIFTDR register is continued after all the data is written, writing will be invalid and an overflow occurs.</description>
                        <lsb>16</lsb>
                        <msb>16</msb>
                        <access>read-write</access>
                        <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                        <readAction>modify</readAction>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Number of data bytes for transmission in SSIFTDR is greater than the set transmit trigger number.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Number of data bytes for transmission in SSIFTDR is equal to or less than the set transmit trigger number.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RDC</name>
                        <description>Receive Data Indicate Flag(Indicates the number of data units stored in SSIFRDR)</description>
                        <lsb>8</lsb>
                        <msb>13</msb>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RDF</name>
                        <description>Receive Data Full Flag NOTE:  Since the SSIFRDR register is a 32-byte FIFO register, the maximum number of data bytes that can be read from it while the RDF flag is 1 is indicated in the RDC[3:0] flags. If reading data from the SSIFRDR register is continued after all the data is read, undefined values will be read.</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                        <readAction>modify</readAction>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Number of received data bytes in SSIFRDR is less than the set receive trigger number.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Number of received data bytes in SSIFRDR is equal to or greater than the set receive trigger number.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSIFTDR</name>
                <description>Transmit FIFO Data Register</description>
                <addressOffset>0x18</addressOffset>
                <size>32</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>SSIFTDR</name>
                        <description>SSIFTDR is a write-only FIFO register consisting of eight stages of 32-bit registers for storing data to be serially transmitted.  NOTE: that when the SSIFTDR register is full of data (32 bytes), the next data cannot be written to it. If writing is attempted, it will be ignored and an overflow occurs.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSIFTDR16</name>
                <description>Transmit FIFO Data Register</description>
                <alternateRegister>SSIFTDR</alternateRegister>
                <addressOffset>0x18</addressOffset>
                <size>16</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0x00000000</resetMask>
            </register>
            <register>
                <name>SSIFTDR8</name>
                <description>Transmit FIFO Data Register</description>
                <alternateRegister>SSIFTDR</alternateRegister>
                <addressOffset>0x18</addressOffset>
                <size>8</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0x00000000</resetMask>
            </register>
            <register>
                <name>SSIFRDR</name>
                <description>Receive FIFO Data Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>32</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>SSIFRDR</name>
                        <description>SSIFRDR is a read-only FIFO register consisting of eight stages of 32-bit registers for storing serially received data.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSIFRDR16</name>
                <description>Receive FIFO Data Register</description>
                <alternateRegister>SSIFRDR</alternateRegister>
                <addressOffset>0x1C</addressOffset>
                <size>16</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0x00000000</resetMask>
            </register>
            <register>
                <name>SSIFRDR8</name>
                <description>Receive FIFO Data Register</description>
                <alternateRegister>SSIFRDR</alternateRegister>
                <addressOffset>0x1C</addressOffset>
                <size>8</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0x00000000</resetMask>
            </register>
            <register>
                <name>SSIOFR</name>
                <description>Audio Format Register</description>
                <addressOffset>0x20</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0xFFFFFFFF</resetMask>
                <fields>
                    <field>
                        <name>BCKASTP</name>
                        <description>Whether to Enable Stopping BCK Output When SSIE is in Idle Status</description>
                        <lsb>9</lsb>
                        <msb>9</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Always outputs BCK to the SSIBCK pin.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Automatically controls output of BCK to the SSIBCK pin.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LRCONT</name>
                        <description>Whether to Enable LRCK/FS Continuation</description>
                        <lsb>8</lsb>
                        <msb>8</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Disables LRCK/FS continuation.</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Enables LRCK/FS continuation.</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OMOD</name>
                        <description>Audio Format Select</description>
                        <lsb>0</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>00</name>
                                <description>I2S format</description>
                                <value>#00</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>01</name>
                                <description>TDM format</description>
                                <value>#01</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>10</name>
                                <description>Monaural format</description>
                                <value>#10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11</name>
                                <description>Setting prohibited.</description>
                                <value>#11</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSISCR</name>
                <description>Status Control Register</description>
                <addressOffset>0x24</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <resetMask>0xFFFFFFFF</resetMask>
                <fields>
                    <field>
                        <name>TDES</name>
                        <description>TDE Setting Condition Select</description>
                        <lsb>8</lsb>
                        <msb>12</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>00000</name>
                                <description>SSIFTDR has one stage or more free space</description>
                                <value>#00000</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>00001</name>
                                <description>SSIFTDR has two stages or more free space (snip)</description>
                                <value>#00001</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11110</name>
                                <description>SSIFTDR has thirty-one stages or more free space</description>
                                <value>#11110</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11111</name>
                                <description>SSIFTDR has thirty-two stages or more free space.</description>
                                <value>#11111</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RDFS</name>
                        <description>RDF Setting Condition Select</description>
                        <lsb>0</lsb>
                        <msb>4</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>00000</name>
                                <description>SSIFRDR has one stage or more data size</description>
                                <value>#00000</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>00001</name>
                                <description>SSIFRDR has two stages or more data size (snip)</description>
                                <value>#00001</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11110</name>
                                <description>SSIFRDR has thirty-one stages or more data size</description>
                                <value>#11110</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>11111</name>
                                <description>SSIFRDR has thirty-two stages or more data size.</description>
                                <value>#11111</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
