arcrin/clc_test_firmware/firmwareutil/hal/svd/RA2A1.svd
        <register>
          <name>HL1CTRL2</name>
          <description>Host L1 Control Register 2</description>
          <addressOffset>0x14A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x9F0F</resetMask>
          <fields>
            <field>
              <name>BESL</name>
              <description>BESL &amp; Alternate HIRDThis bit selects the K-State drive period at the time of L1 Resume.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>L1RWE</name>
              <description>LPM Token L1 RemoteWake EnableThese bits specify the value to be set in the RWE field of LPM token.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIRD</name>
              <description>LPM Token HIRD</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>50 us(Setting prohibited(BESL = 0)) / 75 us(BESL = 1)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>125 us(BESL = 0) / 100 us(BESL = 1)</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>200 us(BESL = 0) / 150 us(BESL = 1)</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>275 us(BESL = 0) / 250 us(BESL = 1)</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>350 us(BESL = 0) / 350 us(BESL = 1)</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>425 us(BESL = 0) / 450 us(BESL = 1)</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>500 us(BESL = 0) / 950 us(BESL = 1)</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>575 us(BESL = 0) / 1950 us(BESL = 1)</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>650 us(BESL = 0) / 2950 us(BESL = 1)</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>725 us(BESL = 0) / 3950 us(BESL = 1)</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>800 us(BESL = 0) / 4950 us(BESL = 1)</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>875 us(BESL = 0) / 5950 us(BESL = 1)</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>950 us(BESL = 0) / 6950 us(BESL = 1)</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>1025 us(Setting prohibited(BESL = 0)) / 7950 us(BESL = 1)</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>1100 us(Setting prohibited(BESL = 0)) / 8950 us(BESL = 1)</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>1175 us(Setting prohibited(BESL = 0)) / 9950 us(BESL = 1)</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L1ADDR</name>
              <description>LPM Token DeviceAddressThese bits specify the value to be set in the ADDR field of LPM token.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPUSR0R</name>
          <description>Deep Standby USB Transceiver Control/Pin Monitor Register </description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF4FFFFF</resetMask>
          <fields>
            <field>
              <name>DVBSTSHM</name>
              <description>VBUS InputIndicates VBUS input signal on the HS side of USB port.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVCBHM</name>
              <description>OVRCURB InputIndicates OVRCURB input signal on the HS side of USB port.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVCAHM</name>
              <description>OVRCURA InputIndicates OVRCURA input signal on the HS side of USB port.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPUSR1R</name>
          <description>Deep Standby USB Suspend/Resume Interrupt Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DVBSTSH</name>
              <description>Indication of Return from VBUS Interrupt Source</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Indicates deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Indicates return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOVCBH</name>
              <description>Indication of Return from OVRCURB Interrupt Source</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Indicates deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Indicates return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOVCAH</name>
              <description>Indication of Return from OVRCURA Interrupt Source</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Indicates deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Indicates return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DVBSTSHE</name>
              <description>VBUS Interrupt Enable/Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables return from deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOVCBHE</name>
              <description>OVRCURB Interrupt Enable Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables return from deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOVCAHE</name>
              <description>OVRCURA Interrupt Enable Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables return from deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPUSR2R</name>
          <description>Deep Standby USB Suspend/Resume Interrupt Register</description>
          <addressOffset>0x168</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DMINTE</name>
              <description>DM Interrupt Enable Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables return from deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPINTE</name>
              <description>DP Interrupt Enable Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables return from deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMVAL</name>
              <description>DM InputIndicates DM input signal on the HS side of USB port.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DPVAL</name>
              <description>DP InputIndicates DP input signal on the HS side of USB port.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMINT</name>
              <description>Indication of Return from DM Interrupt Source</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Indicates deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Indicates return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPINT</name>
              <description>Indication of Return from DP Interrupt Source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Indicates deep software standby mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Indicates return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPUSRCR</name>
          <description>Deep Standby USB Suspend/Resume Command Register</description>
          <addressOffset>0x16A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FIXPHYPD</name>
              <description>USB Transceiver Control Fix for PLL</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Go to/Return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXPHY</name>
              <description>USB Transceiver Control Fix</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Go to/Return from deep software standby mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPUSR0R_FS</name>
          <description>Deep Software Standby USB Transceiver Control/Pin Monitor Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF4CFFFF</resetMask>
          <fields>
            <field>
              <name>DVBSTS0</name>
              <description>USB VBUS InputIndicates the VBUS input signal of the USB.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVCB0</name>
              <description>USB OVRCURB InputIndicates the OVRCURB input signal of the USB.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVCA0</name>
              <description>USB OVRCURA InputIndicates the OVRCURA input signal of the USB.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DM0</name>
              <description>USB D-InputIndicates the D- input signal of the USB.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DP0</name>
              <description>USB0 D+ InputIndicates the D+ input signal of the USB.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FIXPHY0</name>
              <description>USB Transceiver Output Fix</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The outputs are fixed in normal mode and on return from deep software standby mode.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The outputs are fixed on transitions to deep software standby mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRPD0</name>
              <description>D+/D- Pull-Down Resistor Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables DP/DM pull-down resistor.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables DP/DM pull-down resistor.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPUE0</name>
              <description>DP Pull-Up Resistor Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables DP pull-up resistor.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables DP pull-up resistor.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRPC0</name>
              <description>USB Single End Receiver Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Input through the DP and DM inputs is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Input through the DP and DM inputs is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
